Repository: 84000/translation-memory-resources
Catalog: post_input/toh101.bo.en.tmx
Source language: bo
Languages: en

source: དེ་དག་ ནི་ བྱང་ཆུབ་ ཀྱི་ སྣོད་ ཀྱང་ ཡིན་ ཞིང་ དེ་དག་ ནི་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱིས་ ཡང་དག་ པར་ དགའ་བ ར་ བྱས་པ་ དག་ ཀྱང་ ཡིན །_
en: they are vessels of awakening. |#| The bodhisattvas bring them joy.

source: དེ་དག་ ནི་ དེ་བཞིན་ གཤེགས་པ་ རྣམས་ ཀྱིས་ ཡང་དག་ པར་ དགའ་བ ར་ བྱས་པ་ དག་ ཀྱང་ ཡིན །_
en: The thus-gone ones bring them joy.

source: དེ་དག་ གི་ ཆོས་ ཀྱི་ མིག་ ཀྱང་ ཕྱེ་བ་ ཡིན་ ཞིང་ དེ་དག་ ཆོས་ ཐམས་ཅད་ ལ་ སྒྲིབ་པ་ མེད་པ་ ཡང་ ཡིན །_
en: They have opened their vision of the Dharma and are not obscured with respect to any phenomenon.

source: དེ་དག་ ནི་ དེ་བཞིན་ གཤེགས་པ་ མཉེས་པ ར་ བྱེད་པ ར་ འོས་པ་ དག་ ཀྱང་ ཡིན་ ཞིང་ དེ་དག་ ནི་ དེ་བཞིན་ གཤེགས་པ་ རྣམས་ ལ་ བྱས་པ་ གཟོབ་ དག་ ཀྱང་ ཡིན །_
en: They rightly please the thus-gone ones and repay their kindness.

source: དེ་དག་ ནི་ ཆོས་ ཀྱི་ རྒྱན་ གྱིས་ བརྒྱན་པ་ དག་ ཀྱང་ ཡིན་ ཞིང་ ཡེ་ཤེས་ ཀྱིས་ བརླན་པ་ དག་ ཀྱང་ ཡིན །_
en: Adorned with the ornaments of the Dharma, they are saturated with wisdom.

source: དེ་དག་ ནི་ ཆོས་ ཀྱི་ ཆར་པ་ འབེབས་པ ར་ བྱེད་ པ་ དག་ ཀྱང་ ཡིན་ ཞིང་ རྒྱལ་བ འི་ ཐུགས་ ཀྱི་ སྲས་ དག་ ཚིམ་པ ར་ བྱེད་པ་ དག་ ཀྱང་ ཡིན །_
en: Letting the rain of Dharma fall, they satisfy the heart children of the victorious ones.

source: དེ་དག་ ནི་ སངས་རྒྱས་ ཀྱི་ ཆོས་ རྣམས་ ཀྱིས་ རྣམ་པར་ འཕེལ་བ ར་ བྱེད་པ་ དག་ ཀྱང་ ཡིན་ ཞིང་ དེ་དག་ ནི་ ཡོན་ཏན་ གྱི་ ལོ་མ་ རྣམས་ སྐྱེས་པ་ དག་ ཀྱང་ ཡིན །_
en: Causing the qualities of buddhahood to increase, they display the foliage of excellent qualities.

source: དེ་དག་ ནི་ བྱང་ཆུབ་ ཀྱི་ ཡན་ལག་ གི་ མེ་ ཏོག་ རྣམས་ ཀྱིས་ མེ་ཏོག་ ཀུན་ ཏུ་ རྒྱས་པ་ དག་ ཀྱང་ ཡིན་ ཞིང་ །_ དེ་དག་ གི་ ནི་ འདོད་ཆགས་ དང་ བྲལ་བ འི་ འབྲས་བུ་ རྣམས་ རབ་ཏུ་ བྱེད་པ་ དག་ ཀྱང་ ཡིན །_
en: Blossoming with the flowers of the branches of awakening, they produce the fruits of freedom from desirous attachment.

source: དེ་དག་ ནི་ བྱང་ཆུབ་ ཀྱི་ སྙིང་པོ་ ལ་ འདུག་པ་ དག་ ཀྱང་ ཡིན་ ཞིང་ དེ་དག་ གིས་ བླ་ ན་ མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ [26b] ཐོབ་པ་ ཡང་ ཡིན །_
en: Residing on the seat of awakening, they attain unexcelled and perfect awakening. [26.b]

source: དེ་དག་ ནི་ ལམ་ སྟོན་པ ར་ བྱེད་པ་ དག་ ཀྱང་ ཡིན་ ཞིང་
en: They are the guides who show the path;

source: དེ་དག་ ནི་ ཆོས་ ཀྱི་ སྦྱིན་པ ས་ རླན་པ ར་ བྱེད་པ་ དག་ ཀྱང་ ཡིན་ ནོ །_།
en: they are immersed in Dharma generosity.

source: བཟང་སྐྱོང་ མདོར་ན་ རིགས་ ཀྱི་ བུ་ དེ་དག་ གི་ ཡོན་ཏན་ རྣམས་ ཏེ །_ |#| བཟང་སྐྱོང་ གལ་ཏེ་ དེ་བཞིན་ གཤེགས་པ ས་ ཐམས་ཅད་ ཡང་ དག་ པར་ བསྟན་ ཀྱང་ དེ་ ནི་ ཡིད་ཆེས་ པར་ དཀའ་བ ར་ འགྱུར་ རོ །_།
en: In short, Bhadrapāla, even if all the thus-gone ones explain the qualities of such noble children, people will find it hard to trust.

source: བཟང་སྐྱོང་ དེ་ དང་ དེ་དག་ ནི་ ང འི་ བསྔགས་པ་ སྨྲ་བ་ དག་ དང་ །_ ཆོས་ ཀྱི་ རྗེས་སུ་ འཐུན་པ འི་ ཆོས་ སྨྲ་བ་ དག་ ཡིན་ ནོ །_།
en: Bhadrapāla, such beings are the ones who proclaim my praises. |#| Those are teachers who speak in accord with the Dharma.

source: བཟང་སྐྱོང་ འདི་ལྟ་སྟེ །_ དཔེར་ན་ མི་ ཞིག་ གིས་ མཚོ་ མ་ དྲོས་པ་ མཐོང་བ ར་ གྱུར་ ཅིང་ དེ འི་ བསྔགས་པ་ ཡང་ ཐོས་པ ར་ གྱུར་ ལ །_
en: $143 “Bhadrapāla, this is how it is. |#| Think of a man who has seen Lake Anavatapta and heard its praises.

source: དེ འི་ ཚེ་ དེས་ སྔོན་མ་ མཐོང་བ འི་ མཚོ་ཆེན་པོ་ གཞན་ ཞིག་ ཀྱང་ མཐོང་ ནས་
en: That man may then see another great lake and say,

source: མཚོ་ མ་ དྲོས་པ་ དེ་ ནི་ འདི འི་ ཚད་ ཁོ་ན |#| འོ་ ཞེས་ ཚིག་ སྨྲ་བ ར་ བྱེད་ ཅིང་ དེ་ བདག་ གིས་ མ་ དྲོས་པ འི་ བསྔགས་པ་ བརྗོད་ དོ་ ཞེས་ ཟེར་ ལ །_
en: ‘The dimensions of that lake are exactly like those of Anavatapta ! |#| I shall sing the praises of Anavatapta !’

source: བསྔགས་པ་ མ་ཡིན་པ་ ཉིད་ སྨྲ་བ་ དེ་བཞིན་ དུ་ བཟང་སྐྱོང་ དེ་དག་ ནི་ མི་ བླུན་པོ་ དག་ ཡིན་ ཞིང་ དེ་དག་ ནི་ ཡོན་ཏན་ དེ་ལྟ་ བུ་ དག་ དང་ །_ ཡེ་ཤེས་ དེ་ལྟ་ བུ་ དག་ དང་ བྲལ་བ་ དག་ སྟེ |#| དེ་དག་ ནི་ བདག་ཅག་ གིས་ དེ་བཞིན་ གཤེགས་པ འི་ བསྔགས་པ་ བརྗོད་པ ར་ བྱ འོ་ ཞེས་ ཟེར་ ལ །_
en: Yet what he then proclaims is not going to be a praise. |#| $144 “Bhadrapāla, the people of the aforementioned kind are similar fools. |#| While deprived of the right kind of qualities and the right kind of wisdom they nevertheless say, ‘We shall sing the praises of the Thus-Gone One!’

source: འཇིག་རྟེན་པ འི་ ཡང་དག་ པ འི་ ལྟ་བ་ དང་ །_ མངོན་པར་ འདུ་བྱེད་པ་ དང་ བཅས་ ཤིང་ ཟག་པ་ དང་ བཅས་པ འི་ ཕུང་པོ་ ཐམས་ཅད་ ཀྱི་ སྦྱོར་བ ས་ ཀུན་ ཏུ་ སྤྱོད་པ ར་ བྱེད་ ཅིང་ །_ དེ་བཞིན་ གཤེགས་པ འི་ ཡེ་ཤེས་ དེ་ ནི་ ཐོགས་པ་ མེད་པ འོ་ ཞེས་ ཚིག་ དེ་སྐད་ ཅེས་ ཀྱང་ སྨྲ་བ ར་ བྱེད་ དེ |#| དེ་དག་ ནི་ བདག་ཅག་ གིས་ བསྔགས་པ་ བརྗོད་པ ར་ བྱ འོ་ ཞེས་ ཟེར་ ལ །_
en: Thus, while abiding by the mundane view, engaging in formation, and engaging all the aggregates of defilement, they maintain this conduct yet declare, ‘The wisdom of the thus-gone ones is unimpeded! |#| Let us offer our praise!’

source: བསྔགས་པ་ མ་ཡིན་པ་ ཉིད་ སྨྲ་བ ར་ འགྱུར་ རོ །_།
en: Yet what they proceed to say is certainly no praise.

source: བཟང་སྐྱོང་ འདི་ལྟ་སྟེ་ དཔེར་ན་ མི་ལ་ ལ་ ཞིག་ གིས་ གསེར་ ནི་ ཁ་དོག་ སེར་པོ་ དང་ གསེར་ ནི་ ཁ་དོག་ སེར་པོ་ སྣང་བ འོ་ ཞེས་ གསེར་ གྱི་ མིང་ཐོ ས་ པར་ གྱུར་ ལ །_
en: $145 “Think, Bhadrapāla, of this analogy. |#| A person may know the word gold , and may also have heard descriptions of the yellow, radiant color of gold.

source: དེས་ འཛམ་བུ འི་ ཆུ་བོ འི་ གསེར་ གྱི་ ཁ་དོག་ མཐོང་ ཞིང་ རིན་ ཐང་ ཡང་ ཐོས་ ནས
en: But even if that person sees the golden color of the Jāmbū River, and hears about its precious value,

source: ཀྱེ་ མི་ ཁྱོད་ ནི་ བརྫུན་ དུ་ སྨྲ་བ་ སྟེ །_ |#| ཁྱོད་ ཀྱིས་ སྨྲས་པ་ དེ་ ལ་ གསེར་ གྱི་ ཁ་དོག་ སེར་པོ་ དེ་ མེད་ དོ་ ཞེས་ སྤོང་བ ར་ བྱེད་ ཅིང་ །_ གཤེ་བ ར་ བྱེད་པ་ དེ་བཞིན་ དུ་ བཟང་སྐྱོང་ མི་ བླུན་པོ་ མིག་ མེད་པ་ དེ་དག་ གིས་ དེ་བཞིན་ གཤེགས་པ འི་ མཚན་ ཐོས་ ཤིང་ ཆོས་ [27a] ཀྱི་ མིང་ཐོ ས་ ཀྱང་ །_
en: he might ignore it. |#| He might also scold the people who informed him, saying, ‘That which you are talking about does not have the yellow color of gold!’

source: ཆོས་ ཀྱི་ མིང་ དེ་ཡང་ ཡང་དག་པ འི་ ལྟ་བ འོ་ ཞེས་ དེ་སྐད་ ཐོས་ ཤིང་ །_ དེ་བཞིན་ གཤེགས་པ འི་ མཚན་ དེ་ཡང་ མཚན་ ཕུན་སུམ་ ཚོགས་པ་ དང་ །_ རིགས་ ཕུན་སུམ་ ཚོགས་པ་ དང་ །_ སྤྱོད་ཡུལ་ ཕུན་སུམ་ ཚོགས་པ་ དང་ །_ འཁོར་ ཕུན་སུམ་ ཚོགས་པ་ དང་ །_ ཆོ་ག་ དང་ སྤྱོད་པ་ ཕུན་སུམ་ ཚོགས་པ འོ་ ཞེས་ དེ་སྐད་ ཐོས་ ལ །_
en: $146 “Likewise, Bhadrapāla, the aforementioned blind fools may have heard the name of the Thus-Gone One, and they may also have heard the word Dharma. [27.a] They may have heard that the name for the Dharma is the true view , and they may have heard it said that the Thus-Gone One’s name, family, dominion, retinue, comportment, and conduct are all perfect.

source: དེ་བཞིན་ གཤེགས་པ་ ཡེ་ཤེས་ ཀྱི་ མཚན་ཉིད་ གང་ གིས་ དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ སངས་རྒྱས་ ཞེས་ བྱ་བ འི་ གྲངས་ སུ་ འགྲོ་བ་ དང་ །_ ཆོས་ ཀྱི་ མཚན་ཉིད་ གང་ གིས་ དེ་བཞིན་ གཤེགས་པ ས་ ཆོས་ ཐམས་ཅད་ གསུངས་པ འི་ དེ་བཞིན་ གཤེགས་པ འི་ མཚན་ཉིད་ ཀྱི་ ཡེ་ཤེས་ དེ་ ནི་ ཐོས་པ ར་ མ་ གྱུར་ ཏེ
en: But they have not heard of the characteristic of the Thus-Gone One’s wisdom—the characteristic that makes him a thus-gone one, a blessed one, a perfect buddha. |#| Neither have they heard of the characteristic of the Dharma—the characteristic through which the Thus-Gone One delivers all teachings, the characteristic of the Thus-Gone One’s wisdom.

source: གང་ གི་ ཚེ་ དེ་དག་ དེ་བཞིན་ གཤེགས་པ འི་ ཡེ་ཤེས་ ཀྱི་ མཚན་ཉིད་ དེ་ ཐོས་པ ར་ གྱུར་པ་ དེ འི་ ཚེ་ མི་ བླུན་པོ་ དེ་དག་ དེ་ ནི་ དེ་ལྟ ར་ མ་ ཡིན་ ནོ །_། |#| ཞེས་ དེ་སྐད་ ཅེས་ སྨྲ་བ ར་ འགྱུར་ རོ །_།
en: Moreover, when at some point they do in fact hear about the characteristic of the Thus-Gone One’s wisdom, such fools proceed to reject it.

source: བཟང་སྐྱོང་ འདི་ལྟ་སྟེ་ དཔེར་ན་ མི་ལ་ ལ་ ཞིག་ གིས་ རྒྱ་མཚོ་ ཆེན་པོ འི་ མིང་ཐོ ས་ པར་ གྱུར་ ལ །_ རྒྱ་མཚོ་ ཆེན་པོ འི་ ཡོན་ཏན་ རྣམས་ ནི་ ཐོས་པ ར་ མ་ གྱུར་ ཏེ །_
en: $147 “Bhadrapāla, somebody may have heard the word ocean yet not be aware of the ocean’s qualities.

source: གང་ གི་ ཚེ་ དེས་ རྒྱ་མཚོ་ ཆེན་པོ་ ནི་ འཕང་ དུ་ དཔག་ཚད་ བརྒྱད་ ཁྲི་ བཞི་ སྟོང་ ཡོད་ ལ་ ཐད་ཀ ར་ ནི་ དཔག་ཚད་ ཚད་ མེད་པ་ དང་ །_ རིན་པོ་ཆེ་ རྣམ་པ་ སྣ་ཚོགས་ ཀྱིས་ གང་བ་ དང་ རོ་ གཅིག་ ཅིང་ གང་བ་ ཡང་ མེད་ བྲི་བ་ ཡང་ མེད་པ་ ཡིན་ ནོ་ ཞེས་ རྒྱ་མཚོ་ ཆེན་པོ འི་ ཡོན་ཏན་ བསྒྲགས་པ་ ཐོས་ ཤིང་ ཡོན་ཏན་ བསྒྲགས་པ་ དེ་དེ ས་ ཐོས་ ནས་ཆུ་བོ་ ཆེན་པོ་ དག་ ཀྱང་ འབབ་ ལ །_ |#| གང་ བ ར་ ཡང་ མི་འགྱུར་བ་ དང་ །_ དེ་ལས་ རིན་པོ་ཆེ་ དེ་སྙེད་ འབྱུང་བ ར་ ཡང་ འགྱུར་བ་ དང་ །_ དེ་ཡང་ རྒྱ ར་ ནི་ དཔག་ ཏུ་ མེད་པ་ ཡིན་ ནོ་ ཞེས་ ཇི་སྐད་ བྱ་ ཞེས་ ཡིད་ མི་ ཆེས་ ཤིང་ རྒྱ་མཚོ་ ཆེན་པོ འི་ ཡོན་ཏན་ དེ་ལྟ་ བུ་ དེ་དག་ ཡིན་པ་ འདི་ ནི་ གནས་ མེད་ དོ་ ཞེས་ ཟེར་བ་ དེ་བཞིན་ དུ །_
en: The same person may then be told that the ocean is eighty-four thousand leagues deep and limitless leagues wide. |#| He or she may likewise hear that the ocean abounds with numerous jewels, that it is of a single taste, and that it neither increases nor becomes depleted. |#| When hearing such descriptions of how the ocean does not fill up although fed by the rivers, how they are the source of so many jewels, and how its extent is limitless, this person may object that ‘the ocean could not possibly have such characteristics!’ |#| $148 “Likewise,

source: བཟང་ སྐྱོང་ མི་ བླུན་པོ་ དེ་དག་ གིས་ དེ་བཞིན་ གཤེགས་པ འི་ མཚན་ ཐོས་པ ར་ གྱུར་ ཅིང་ སངས་རྒྱས་ ཀྱི་ སྒྲ་ ཐོས་པ ར་ གྱུར་ ཀྱང་ །_ དེ་བཞིན་ གཤེགས་པ འི་ ཡོན་ཏན་ དེ་དག་ དེས་ ཐོས་པ ར་ མ་ གྱུར་ ཅིང་ ཆོས་ཤེས་པ འི་ ཡོན་ཏན་ དག་ ཐོས་པ ར་ མ་ གྱུར་ ཏེ
en: Bhadrapāla, those fools have heard the name Thus-Gone One and the word buddha . |#| But they have not heard about the qualities of the thus-gone ones or the qualities of knowing the Dharma.

source: གང་ གི་ ཚེ་ དེས་ ཐམས་ཅད་ [27b] མཁྱེན་པ འི་ ཡེ་ཤེས་ ཆོས་ དཀོན་མཆོག་ དཔག་ ཏུ་ མེད་པ ས་ གང་བ །_ འདོད་ཆགས་ དང་ བྲལ་བ་ དང་ །_ རྣམ་པར་ གྲོལ་བ་ ཆེན་པོ་ སྒྲུབ་པ ར་ བྱེད་པ་ དཔག་ ཏུ་ མེད་པ །_ སངས་རྒྱས་ ཀྱི་ སྤྱན་ སྒྲིབ་པ་ མེད་པ །_ ཟག་པ་ མེད་པ འི་ ཆོས་ གང་བ་ ཡང་ མེད །_ |#| བྲི་བ་ ཡང་ མེད་པ་ དང་ །_ གཏིང་དཔག་ དཀའ་བ་ དང་ །_ མི་ འཁྲུགས་པ་ དང་ །_ ཆོས་ ཐམས་ཅད་ ཀྱི་ ཡེ་ཤེས་ ཀྱི་ ཕྱག་རྒྱ་ དང་ །_ ཇི་ལྟ ར་ རྒྱ་མཚོ་ ཆེན་པོ་ མི འི་ རོ་ དང་ ལྷན་ཅིག་ ཏུ་ མི་ གནས་པ་ དེ་བཞིན་ དུ་ དེ་བཞིན་ གཤེགས་པ་ ལྟ་བ་ ཐིབས་པོ་ ཐམས་ཅད་ ཀྱིས་ ཆུད་ ཟོས་པ འི་ སེམས་ཅན་ རྣམས་ དང་ ལྷན་ཅིག་ མི་ གནས་པ་ དང་ །_ ཇི་ལྟ ར་ རྒྱ་མཚོ་ ཆེན་པོ་ འདི་ལྟ་སྟེ །_ |#| ལན་ཚྭ འི་ རོ ར་ རོ་ གཅིག་པ་ དེ་བཞིན་ དུ་ དེ་བཞིན་ གཤེགས་པ འི་ རྣམ་པར་ གྲོལ་བ ར་ རོ་ གཅིག་པ ར་ འགྱུར་བ འི་ ཆོས་ ཀྱི་ རྣམ་ གྲངས་ དེ་ལྟ་ བུ་ དེ་ ཐོས་ ཤིང་ དེ་དག་ དེ་སྐད་ ཅེས་ ཐོས་ ནས་
en: However, at some point they may come to hear Dharma teachings concerning [27.b] the omniscient wisdom, full of limitless jewels of the Dharma. |#| They may hear of how the precious Dharma is free from desire and how it provides boundless means for achieving great liberation. |#| They may hear of the unobscured buddha eye, how the undefiled qualities know neither increase nor decrease, and how they are hard to fathom and free from disturbance. |#| They may come to hear that all phenomena bear the seal of wisdom. |#| Likewise, they may be told that just like the ocean will not retain a human corpse, the thus-gone ones will not rest with beings who are spoiled by dense, dark views. |#| Similarly, they may hear the teaching that just like the ocean is always salty, the liberation of the thus-gone ones is also always of one taste.

source: ཁོང་ དུ་ ཆུད་པ ར་ མི་ བྱེད་ ཅིང་ མངོན་པར་ ཡིད་ཆེས་ པར་ མི་ བྱེད་ ལ །_ མོས་པ ར་ མི་ བྱེད་ དེ
en: Yet they do not understand this and they do not believe it.

source: དེ་ལྟ་ མ་ ཡིན་ ནོ་ ཞེས་ ཚིག་ སྨྲ་བ ར་ བྱེད་ དོ །_།
en: Not trusting it, they deny that any of this could be the case.

source: བཟང་སྐྱོང་ མི་ བླུན་པོ་ དེ་དག་ བདག་ཅག་ གིས་ ཅི་ ཤེས་ ཞེ འམ །_ བདག་ཅག་ གིས་ ཇི་སྙེད་ བསླབས་ ཞེས་ དེ་ལྟ ར་ ཡང་ ལྟ་བ ར་ མི་འགྱུར་བ་ ལ་ ལྟོས །_
en: $149 “Consider, Bhadrapāla, how fools never question their own knowledge or the extent of their training.

source: རེ་ཞིག་ བདག་ཅག་ ཉིད་ ཀྱི་ སྤྱོད་པ་ ཡང་ མི་ ཤེས་པ་ དང་ །_ བདག་ཅག་ ག་ལ ས་ སྤྱད་ ཅེས་ གནས་ མི་ ཤེས་པ་ དང་ །_ ལས་མི་ ཤེས་པ་ དང་ །_ རྣམ་པར་ སྨིན་པ་ མི་ ཤེས་པ་ དང་ །_ བདག་ཅག་ ལས་ གང་ གིས་ འདིར་ སྐྱེས་པ་ དང་ །_ བདག་ཅག་ གི་ ལས་ འདིར་ སྐྱེས་པ་ དང་ །_ བདག་ཅག་ གི་ འགྲོ་བ་ ཡང་ གང་ཡིན་པ་ དང་ །_ བདག་ཅག་ རྣམ་པ་ ཇི་ལྟ་བུ་ དང་ །_ སྦྱོར་བ་ ཇི་ལྟ་བུ་ དང་ །_ བདག་ཅག་ ཤེས་པ་ དང་ ལྡན་ ཞིང་ལས་ བྱེད་ དམ །_ ཤེས་པ་ དང་ མི་ ལྡན་ ཞིང་ལས་ བྱེད་ ཅེས་ དེ་དག་ གིས་ དེ་སྐད་ ཅེས་ བདག་ཉིད་ བརྗོད་པ ར་ བྱ འོ །_།
en: However, I declare that there will come a time when they say, ‘We do not know the proper conduct and practice. |#| We do not understand karmic action and the way karma ripens. |#| We do not know what actions led us to birth here, and where our present actions will bring us. |#| We do not know what the realm will be, nor what our features and practice are going to be. |#| Neither do we know whether or not we will be able to act based on insight.’

source: གལ་ཏེ་ ཆོས་ དེ་དག་ ལ་ མི་ བླུན་པོ་ དེ་དག་ ཆོས་ ཀྱི་ འདུ་ཤེས་ དང་ ང འི་ བསྔགས་པ་ མ་ཡིན་པ འི་ འདུ་ཤེས་ བསྐྱེད་ ན་
en: Such unquestioning fools may develop the idea that these Dharma teachings are neither Dharma, nor any praise to me.

source: ང འི་ ཚིག་ གིས་ མི་ བླུན་པོ་ དེ་དག་ མདོ་སྡེ་ དག་ ལ་ མི་ རྟོན་པ ར་ འགྱུར་ རོ །_།
en: In that case my words will have become the reason for such fools not to rely on the sūtras.

source: ང་ འདས་ ནས་ |#| དེ་བཞིན་ གཤེགས་པ འི་ བསྔགས་པ་ བརྗོད་པ་ དང་ །_ ཆོས་ ཀྱི་ བསྔགས་པ་ [28a] བརྗོད་པ་ དང་ །_ དགེ་འདུན་ གྱི་ བསྔགས་པ་ བརྗོད་པ་ ན་
en: $150 “When, after my passing, someone expresses a praise to the Thus-Gone One, or to the Dharma, [28.a] or to the Saṅgha, then

source: དེ་ ལ་ ཁྱེད་ཅག་ གིས་ མི་གུ ས་ པར་ མི་ བྱ་ ཞིང་ ཡིད་ མི་ ཆེས་པ ར་ མ་ ཡིན་ ལ །_
en: you must not be disrespectful or distrustful.

source: སེམས་ གཞན་ དུ་ འགྱུར་བ་ དང་ །_ མངོན་པར་ མི་ དགའ་བ ར་ མི་ བྱ འོ་ ཞེས་ ཀྱང་ དེ་བཞིན་ གཤེགས་པ ས་ གསུངས་ སོ །_།
en: You must not let your mind turn away, and you must not be displeased. |#| This is how the Thus-Gone One instructs you.

source: གལ་ཏེ་ དེ་ ལ་ ངས་ གདམས་ངག་ བསྐྱེད་པ ར་ བྱ་ན་ འདི་ལྟ་སྟེ་ ཞེ་ འགྲས་པ འི་ སེམས་ དང་ ལྡན་པ་ དེ་ ནི་ དགེ་སྦྱོང་ གི་ ཆོས་མ་ ཡིན་ ཞིང་ །_ |#| དགེ་སྦྱོང་ མ་ཡིན་པ་ དང་ ཐུན་མོང་བ་ འདི་ལྟ་སྟེ །_
en: $151 “My instruction, here, is that a hostile mind is not the way of mendicants; |#| it is common to those who are not mendicants. |#| Moreover,

source: དགེ་སྦྱོང་ མ་ཡིན་པ་ རྣམས་ དང་ དགེ་སྦྱོང་ མ་ཡིན་པ ར་ ཐུན་མོང་བ འི་ ལམ་ ལ་ ཞུགས་པ འི་ གནས་ དེ་ |#| ནི་ སྐྱོན་ མང་པོ འི་ ཤས་ ཆེ་བ་ ཡིན་ ཞིང་ །_
en: not being a mendicant and following the ways of those who are not mendicants is flawed in numerous ways.

source: དེ་བཞིན་ གཤེགས་པ་ རྣམས་ ཀྱི་ བྱང་ཆུབ་ གཏིང་དཔག་ དཀའ་བ་ ཡིན་ ཏེ
en: The awakening of the thus-gone ones is hard to fathom.

source: དེ འི་ ཕྱིར་ བདག་ གིས་ དྲན་པ་ ཉེ་བ ར་ གཞག་པ་ རྣམས་ ཁོ་ན་ བསྟན་པ ར་ བྱ འོ་ ཞེས་ གདམས་པ ར་ བྱ འོ །_།
en: Hence, my instruction is that only the applications of mindfulness should be taught.

source: བཟང་སྐྱོང་ དེ་ ལ་ ཆོས་ ཐམས་ཅད་ ཀྱི་ ངོ་བོ་ ཉིད་ ཀྱིས་ གནས་པ་ དག་ ནི་ མི་ གནས་པ་ དག་ ཉིད་ དེ །_
en: $152 “Bhadrapāla, the way all phenomena essentially abide is beyond abiding, and

source: ཆོས་ ཐམས་ཅད་ དེ་ལྟ ར་ གནས་པ་ དག་ ཉིད་ རྣམ་པར་ མི་ རྟོག་པ་ དག་ གོ །_།
en: this way of abiding is nonconceptual.

source: བཟང་སྐྱོང་ འདི་ལྟ་སྟེ་ འཇུག་པ འི་ སྒོ་ དང་ །_ རྟོགས་པ འི་ སྒོ་ དང་ །_ རྣམ་པར་ ཐར་པ འི་ སྒོ་ དེ་ ནི་ དྲན་པ་ ཉེ་བ ར་ གཞག་པ་ རྣམས་ ཀྱི་ སྒོ་ ཡིན་ ནོ །_།
en: Bhadrapāla, in this context, the three gateways to access, realization, and liberation are the gateways to the applications of mindfulness.

source: བཟང་སྐྱོང་ གནས་ དང་ གནས་མ་ ཡིན་པ་ དེ་ ནི་ གཉིས་ ཡིན་ ནོ །_།
en: $153 “Bhadrapāla, tenable and untenable are duality.

source: བཟང་སྐྱོང་ ཡང་དག་པ འི་ ལྟ་བ་ དང་ མཐའ་མི་ དམིགས་པ འི་ ཕྱིར་ མཐའ་ རྣམ་པར་ སྤངས་པ་ ནི་ གཉིས་ ལ་མ་ ཆགས་པ་ ཡིན་ ནོ །_།
en: Bhadrapāla, in the true view and the relinquishment of extremes that comes from not observing any extremes there is no attachment to duality.

source: བཟང་སྐྱོང་ དེ་བཞིན་ གཤེགས་པ ས་ མཐའ་མ་ བརྙེས་པ འི་ ཕྱིར་ མཐའ་ རྣམ་པར་ སྤངས་ པ་ མ་ ཡིན་མོད་ ཀྱི །_
en: Bhadrapāla, the thus-gone ones’ relinquishment of extremes is not due to a failure to identify such extremes.

source: འོན་ཀྱང་ གང་ གི་ ཕྱིར་ མི་ དམིགས་པ་ དེ་ཉིད་ ཀྱི་ ཕྱིར་ དེ་བཞིན་ གཤེགས་པ ས་ དེ་ རྣམ་པར་ སྤངས་པ་ ཡིན་ ནོ །_།
en: Rather, the thus-gone ones have abandoned extremes because they do not observe any.

source: བཟང་སྐྱོང་ དེ་བཞིན་ གཤེགས་པ ས་ རྣམ་པར་ སྤངས་པ འི་ ཆོས་ དེ་དག་ ཇི་ལྟ ར་ བྱིས་པ་ དག་ གིས་ བཟུང་བ་ དེ་བཞིན་ དུ་ མཁས་པ་ དག་ འཛིན་པ ར་ མི་ བྱེད་ དོ །_།
en: Bhadrapāla, the wise do not understand the qualities of the thus-gone ones’ relinquishment in the same way that childish beings take them to be.

source: བཟང་སྐྱོང་ ཇི་ལྟ ར་ ཆོས་ རྣམས་ ཀྱི་ ཆོས་ ཀྱི་ མཚན་ཉིད་ དེ་ལྟ ར་ རྣམ་པར་ སྤངས་པ་ མ་ ཡིན་ ཞིང་ །_ ཡང་དག་ པར་ འདས་པ་ མ་ ཡིན་ ལ །_
en: Those qualities, Bhadrapāla, are characterized neither by relinquishment nor transcendence.

source: བོར་བ་ མ་ ཡིན་ ཞིང་ རྙེད་པ་ མ་ ཡིན་ ནོ །_།
en: Their characteristics are neither in terms of abandonment nor attainment.

source: བཟང་སྐྱོང་ གང་ ང འི་ ཐད་ དུ་ ཕྱིན་ ནས་ འདི་སྐད་ ཅེས་ སྨྲ་བ འི་ ལྷ་ དེ འི་ [28b] ཚིག་ ལན་ ངས་ འདི་སྐད་ ཅེས་ བཏབ་ སྟེ །_
en: $154 “Bhadrapāla, once a deity came before me [28.b] and asked,

source: དགེ་སྦྱོང་ དགྱེས་པ་ མཛད་ དམ །_
en: ‘Mendicant, are you in high spirits?’

source: ངས་ སྨྲས་པ །_
en: I replied,

source: ལྷ་ང ས་ ཅི་ སྙེད །_
en: ‘Deity,’ |#| ‘what should I have gained?’

source: དགེ་སྦྱོང་ ཐུགས་ ངན་ མཛད་ དམ །_
en: Again the god asked, ‘Mendicant, are you depressed?’

source: ལྷ་ང འི་ ཅི་ ཆུད་ ཟོས །_
en: ‘Deity,’ |#| ‘what should I have wasted?’

source: དེས་ གསོལ་པ །_
en: At this point the god exclaimed,

source: དགེ་སྦྱོང་ དགྱེས་པ འང་ མ་ ལགས་ ཐུགས་ ངན་ ཡང་ མི་ མཛད་པ་ ནི་ དགེ་སྦྱོང་ ལེགས་ སོ་ ལེགས་ སོ །_།
en: ‘A mendicant who is neither in high spirits nor depressed is indeed an excellent mendicant!’

source: བཟང་སྐྱོང་ ལྷ་ དེ་ འཁོར་ འདི་ཉིད་ དུ་ འདུས་པ ར་ གྱུར་ ནས་ འདུག་ སྟེ །_
en: Bhadrapāla, that god is now present in this gathering.

source: བཟང་སྐྱོང་ དེས་ ཆོས་ ཐམས་ཅད་ རང་བཞིན་ གྱིས་ ཡོངས་སུ་ མྱ་ངན་ ལས་ འདས་པ་ དག་ ཀུན་ དུ་ ཤེས་ སོ །_།
en: He has, Bhadrapāla, comprehended how all phenomena are of the nature of nirvāṇa.

source: ལྷ་ དེས་ ནི་ སྔོན་ སངས་རྒྱས་ ལྔ་ བརྒྱ་ དག་ མཉེས་པ ར་ བྱས་ ཏེ །_
en: In the past he has served five hundred buddhas, and

source: དེ་དག་ མཉེས་པ ར་ བྱས་པ ས་ ལྷ་ དེ་དེ་ ལྟར་ མངོན་པར་ ཤེས་པ་ མྱུར་བ ར་ གྱུར་ ཏོ །_།
en: as the result of such service his superknowledges are agile.

source: བཟང་སྐྱོང་ སེམས་ཅན་ དགེ་བ འི་ རྩ་བ་ མ་ བསྐྱེད་པ་ རྣམས་ དང་ །_ དགེ་བ འི་ རྩ་བ་ ཡོངས་སུ་ མ་ སྨིན་པ་ རྣམས་ ཆོས་ དེ་དག་ ལ་ འདུལ་བ འི་ ཕྱིར་ མོས་པ ར་ ང་ མི་སྨྲ འོ །_།
en: $155 “Bhadrapāla, I do not say that beings who lack roots of virtue, or whose roots of virtue have not matured, will be inspired to pursue the training in this Dharma teaching.

source: དེ་བཞིན་ དུ་ ཉན་ཐོས་ རྣམས་ ཀྱི་ མོས་པ་ མ་ མཐོང་ ངོ་ །_།
en: Nor do I perceive any such inspiration in the listeners either.

source: བཟང་སྐྱོང་ ཆོས་ དེ་དག་ གང་ལ་ལ ས་ ཐོས་ ནས་ |#| ཐོས་པ འི་ མོད་ ལ་མོ ས་ པར་ འགྱུར་བ འམ །_ དད་པ ར་ འགྱུར་བ འམ །_ ཡིད་ཆེས་ པར་ འགྱུར་བ འི་ དགེ་བ འི་ རྩ་བ་ དེ་ ནི་ ནང་ གི་ ཆུང་ངུ ར་ འགྱུར་ ཏེ
en: $156 “Bhadrapāla, when someone hears these teachings and becomes inspired and develops faith and trust, the associated roots of virtue are of a lesser, inner kind.

source: དེ འི་ གོང་ ན་ ཤེས་རབ་ ཀྱི་ ཕུང་ པོ འི་ ཡེ་ཤེས་ ཤིན་ཏུ་ རྒྱས་པ ས་ ཡེ་ཤེས་ ལ་ འཇུག་པ འི་ དགེ་བ འི་ རྩ་བ་ རྣམས་ ནི་ རྒྱ་ཆེ་བ ར་ བལྟ་བ ར་ བྱ འོ །_།
en: Above that stage, as the wisdom of great insight unfolds, one will experience wisdom. |#| The roots of virtue that arise from that are vast.”

source: དེ་ནས་ བཟང་སྐྱོང་ ལ་སོགས་པ་ བྱང་ཆུབ་ སེམས་དཔའ་ ལྔ་ བརྒྱ་ ཙམ་པོ་ དེ་དག་ གིས་ བཅོམ་ལྡན་འདས་ ལ་ ལག་པ་ ལྟ་བུ འི་ པད་མ་ དེས་ གཏོར་ ཅིང་ མངོན་པར་ གཏོར་ ནས་ ཚིག་ འདི་སྐད་ ཅེས་ གསོལ་ ཏོ །_།
en: $157 Bhadrapāla and the others among the five hundred bodhisattvas then tossed the hand-like lotus flower before the Blessed One, offering it with the following words:

source: བཅོམ་ལྡན་འདས་ གང་དག་ ལག་པ་ ལྟ་བུ འི་ པད་མ འི་ ཆོས་ ཀྱི་ རྣམ་ གྲངས་ དེ་ |#| ལ་ དམིགས་ ནས་ |#| ཡོངས་སུ་ ཚོལ་ བར་ བགྱིད་པ འམ །_ ཉན་པ ར་ བགྱིད་པ་ དེ་དག་ ཐམས་ཅད་ བླ་ ན་ |#| མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ ངེས་པ ར་ འགྱུར་ ལགས་སོ །_།
en: “Blessed One, may all who witness this Dharma teaching of the hand-like lotus flower and pursue or apply themselves to it become destined for unexcelled and perfect awakening.

source: བཅོམ་ལྡན་འདས་ ཕྱོགས་ བཅུ་ ན་ སངས་རྒྱས་ བཅོམ་ལྡན་འདས་ གང་དག་ བཞུགས་ ཏེ་ |#| འཚོ་ ཞིང་ གཞེས་པ འི་ དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ སངས་རྒྱས་ དེ་དག་ ལ་ ཡང་ དམིགས་པ་ དེས་ འདི་ལྟ་སྟེ |#| སེམས་ཅན་ རྣམས་ ཀྱི་ བྱང་ཆུབ་ ཀྱི་ [29a] ཕྱོགས་ ཀྱི་ ཆོས་ ཡོངས་སུ་ སྨིན་པ ར་ བགྱི་བ འི་ སླད་ དུ་ ཆོས་ བསྟན་པ ར་ གསོལ་བ་ འདེབས་ ལགས་སོ །_།
en: Blessed One, may all the blessed buddhas who reside, remain, and flourish throughout the ten directions—all such thus-gone ones, worthy ones, perfect buddhas—apprehend this Dharma teaching [29.a] and teach it for the sake of ripening the factors of awakening within sentient beings.”

source: དེ་ནས་ བཅོམ་ལྡན་འདས་ ཀྱིས་ མཁྱེན་ བཞིན་ དུ་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ བཟང་སྐྱོང་ ལ་ འདི་སྐད་ ཅེས་ བཀའ་ སྩལ་ ཏོ །_།
en: $158 Aware of all this, the Blessed One now said to the bodhisattva great being Bhadrapāla,

source: བཟང་སྐྱོང་ ཁྱོད་ ལ་ སེམས་ཅན་ རྣམས་ ཀྱིས་ ཕན་ བཏགས་ སམ་ ཞེ་ན་ གང་ གི་ ཕྱིར་ ཁྱོད་ སེམས་ཅན་ རྣམས་ ཀྱི་ བྱང་ཆུབ་ ཀྱི་ ཕྱོགས་ ཀྱི་ ཆོས་ ཡོངས་སུ་ སྨིན་པ ར་ བྱ་བ འི་ ཕྱིར་ སེམས་ཅན་ རྣམས་ ཀྱི་ དོན་ དུ་ གོ་ཆ་ བགོས་ ཤིང་ །_ དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ སངས་རྒྱས་ དེ་དག་ ལ་ ཡང་ ཆོས་ བསྟན་པ ར་ གསོལ་བ་ འདེབས །_
en: “Bhadrapāla, you bear your armor for the sake of ripening the factors of awakening within sentient beings, and you request the thus-gone ones, the worthy ones, the perfect buddhas to teach the Dharma to these sentient beings. |#| Does this mean that sentient beings are of some benefit to you?”

source: བཅོམ་ལྡན་འདས་ ལ་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ བཟང་སྐྱོང་ གིས་ འདི་སྐད་ ཅེས་ གསོལ་ ཏོ །_།
en: $159 In reply, the bodhisattva great being Bhadrapāla addressed the Blessed One:

source: བཅོམ་ལྡན་འདས་ བདག་ ལ་ སེམས་ཅན་ དེ་དག་ གིས་ སྨན་ བཏགས་པ ས་ བདག་ གིས་ དེ་དག་ ཀྱང་ སངས་རྒྱས་ ཀྱི་ ཞིང་ དག་ ཏུ་ དགོད་པ ར་ བགྱི་བ འམ །_ དེ་དག་ གིས་ གནོད་པ་ བགྱིས་པ ས་ དེ་དག་ སངས་རྒྱས་ ཀྱི་ ཞིང་ དག་ ཏུ་ དགོད་པ ར་ མི་ བགྱི འོ་ ཞེས་ གནོད་པ ར་ བགྱི་བ འམ །_ ཕན་ གདགས་པ འི་ སླད་ དུ་ སེམས་ཅན་ རྣམས་ ཀྱི་ དོན་ དུ་ གོ་ཆ་ དེ་ བགོས་པ་ མ་ ལགས་ ཏེ །_
en: “Blessed One, I have no wish to send those who benefit me to buddha realms. |#| Nor do I feel disinclined to do so with those who harm me. |#| I do not bear my armor for sentient beings in order to harm or benefit anyone.

source: བཅོམ་ལྡན་འདས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ དེ་ལྟ་ བུ འི་ གོ་ཆ་ མི་ འཚལ་བ འི་ སླད་ དུའོ །_།
en: Blessed One, the armor donned by bodhisattvas is not of that kind.

source: བཅོམ་ལྡན་འདས་ དཔེ ར་ བགྱི་ ན་ |#| ཡན་ལག་ ཐམས་ཅད་ ལས་ མེ་ཏོག་ ཀུན་ དུ་ རྒྱས་པ འི་ ཤིང་ ཡོངས་འདུ་ ས་བརྟོལ་ གྱིས་ སུམ་ཅུ་རྩ་གསུམ་པ འི་ ལྷ་ རྣམས་ དགའ་བ ར་ འགྱུར་བ་ དང་ །_ ཡན་ལག་ ཐམས་ཅད་ ལས་ མེ་ཏོག་ ཀུན་ དུ་ རྒྱས་པ འི་ ཤིང་ ཡོངས་འདུ་ ས་བརྟོལ་ མཐོང་ ནས
en: $160 “Blessed One, let us take the analogy of a perfect, wish-fulfilling tree with blossoming flowers on all its branches, a tree that is of great delight to the gods in the Heaven of the Thirty-Three. |#| As they perceive this heavenly, wish-fulfilling tree in full bloom,

source: དེ་ ལ་ ཡང་ སུམ་ཅུ་རྩ་གསུམ་པ འི་ ལྷ་ རྣམས་ མི འི་ མ་ ལགས་པ འི་ འདོད་པ འི་ ཡོན་ཏན་ ལྔ་པོ་ དག་ གིས་ རྩེ་ ཞིང་ དགའ་ ལ་ དགའ་མགུ ར་ སྤྱོད་པ ར་ བགྱིད་པ ར་ གྱུར་ ན །_
en: the gods of the Thirty-Three will, to their hearts’ content, enjoy and revel in superhuman sense pleasures.

source: བཅོམ་ལྡན་ འདས་ འོ་ན་ ཅི་ སུམ་ཅུ་རྩ་གསུམ་པ འི་ ལྷ་ རྣམས་ ཀྱིས་ ཡན་ལག་ ཐམས་ཅད་ ལས་ མེ་ཏོག་ ཀུན་ དུ་ རྒྱས་པ འི་ ཤིང་ ཡོངས་འདུ་ ས་བརྟོལ་ ལ་ གནོད་པ ར་ བགྱི་བ འམ །_ སྨན་ གདགས་པ ར་ བགྱིས་ ལགས་ སམ །_
en: But, Blessed One, do the gods of the Thirty-Three then harm or benefit that perfect, wish-fulfilling tree that is in full bloom?

source: གང་ གི་ སླད་ དུ་ ཡོངས་འདུ་ ས་བརྟོལ་ མཐོང་ ནས་ |#| སུམ་ཅུ་རྩ་གསུམ་པ འི་ [29b] ལྷ་ རྣམས་ དགའ་བ ར་ འགྱུར་ ཞིང་ །_
en: As they see the perfect, wish-fulfilling tree the gods of the Thirty-Three [29.b] will be delighted.
